Revit 2026 API

# LeadersPresentationMode Enumeration

---

Leaders Presentation Mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LeadersPresentationMode
```
```vb
Public Enumeration LeadersPresentationMode
```
```cpp
public enum class LeadersPresentationMode
```
```fsharp
type LeadersPresentationMode
```

| Member name | Value | Description |
| --- | --- | --- |
| HideAll | 1 | Hide all tag leaders. |
| ShowAll | 0 | Show all tag leaders. |
| ShowOnlyOne | 2 | Show only one leader. |
| ShowSpecificLeaders | 3 | Show specific leaders. |

#### Reference

Autodesk.Revit.DB Namespace